import React, { useEffect } from 'react';

import CVComponent from '../components/CVComponent';
import HeroSection from '../components/HeroSection';
import Banner from '../components/Banner';
import { useLoaderData } from 'react-router-dom';

function LandingPage() {
  // async function getArticles() {
  const { headshot, header } = useLoaderData();

  return (
    <main id="landing-page">
      <Banner imgUrl={header} />
      <HeroSection img={headshot} text={`${landingText} \n\n${date}`} />

      <section className="intro">
        <p className="linebreak">
          هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
          النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من
          النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
          {'\n'} إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى
          زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية،
          مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل
          فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
          {'\n'} ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر
          للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث
          عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا
          يليق.{'\n'} هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن
          يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال
          نصاً بديلاً ومؤقتاً.
        </p>
      </section>
      <CVComponent />
    </main>
  );
}

export default LandingPage;

const signature = 'عقيل سوار';
const date = ' ٩ يونيو ١٩٨٥';

const landingText =
  'في العشرين من عمري، كنت اؤمن بانني املك مفاتيح مشاكل البشرية قاطبة...\n\nفي الثلاثين، تعرضت كل قناعاتي لهزة عنيفة، شعرت بعدها، انني وصلت لمرحلة النضج...\n\nالآن.. في السادسة والثلاثين.. لست واثقا من شيء!!';

const cv =
  'السيرة الذاتية :  عقيل خليل ابراهيم آل سوار\nمن مواليد المنامة 1945\nمتزوج وله ابنتان وولد\n1965: عمل في طيران الخليج قسم التموين\n1970: انشأ مؤسسة التصوير ”بنسوار\n1973 - 1977 محرر في صدى الاسبوع\n1981: مؤسسة الشرق للاعلان (علي صالح)\n1982 : ادارة تحرير مجلة صدى الاسبوع\n1983 : ادارة تحرير مجلة بنوراما الخليج\n1986 – 1996 محرر في جريدة اخبار الخليج\n1997 – سبتمبر 2005 كاتب عمود في جريدة الايام\nاكتوبر 2005 حتى يناير 2012 كاتب عمود في جريدة الوطن\nكاتب مسرحي نفذت له عدة مسرحيات  على خشبة مسرح اوال وعمل واحد في الكويت\nالبراحة – 1980\nبنت لنوخذة - 1986\nرجل من عامة الناس (شاركت في مهرجان بغداد المسرحي 1984)\nخميس وجمعة – 1989\nافا يا عبيد – 1989 \nسوق المقاصيص – 1991\nربع المكدة\nجويرة – 1997 الورشة المسرحية مع د. عوني كرومي\nفاز بجائزة وزارة الاعلام البحربنبة عن احسن نص مسرحي (رجل من عامة الناس) 1987';
